# InstanceMovesWithGridParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..InstanceMovesWithGridParam Property
ParameterTypeId Class See Also
---
"Moves With Grids"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId InstanceMovesWithGridParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InstanceMovesWithGridParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ InstanceMovesWithGridParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace